/*
 *Змінні та типи даних
 *
 * - Оголошення змінних з let та const
 * - Перевизначення значення
 * - Найменування змінних
 * - Вибір між const та let
 * - Виведення даних
 * - Отримання даних
 * - Примітивні типи даних: number, string, boolean, null, undefined
 */
//______________________________________________________________________________________________________________________________________________________________

let price = 10; // Створення змінної

console.log(price); // Виклик в консолі

price = 30; // Перевизначення змінної

console.log(price); // Виклик в консолі

const price1 = 10; // Створення змінної

price1 = 30; // Перевизначення const призведе до помилки

const pricePerItem = 30; // Назва змінної пишеться через (ramelCase)

//ВБУДОВАНІ МЕТОДИ_____________________________________________________________________________________________________________________________________________

//PROMPT('...')
const firstName = prompt('Serhii'); // Поле де користувач має ввести данні
console.log(firstName); //виклик

//CONFIRM('...')
const isAdult = confirm('Чи є вам 18 років'); // Вікно в якому користувачть відповідає ТАК або НІ (повертається TRUE або FALSE)
console.log(isAdult);

//ALERT('...')
const isAlert = alert('Просто виводить повідомлення для користувача');
console.log(isAlert);

//ПРИМІТИВНІ ТИПИ ДАНИХ________________________________________________________________________________________________________________________________________

const someNull = null; // NULL на даний момент значення не встановлене

const someUndefined = undefined; // UNDEFINED виводить система як відповідь

const someString = 'Serhii'; // Рядковий тип даних позначається " " або ' '

const someNumber = 36; // Числовий тип даних може мати цілі або дробові числа 10 або 10.5

//ОПЕРАТОР TypeOf______________________________________________________________________________________________________________________________________________

const number = 100;
console.log(typeof number); // Відповідає який тип даних у змінній

//СУРОВИЙ РЕЖИМ_______________________________________________________________________________________________________________________________________________
/*
('use strict');  суровий режим, пишеться на початку коду JS
 або
<script src ="" type ="module" ></script> дописати тип module в підключенні скрипта до html
*/
//____________________________________________________________________________________________________________________________________________________________
