//АРИФМЕТИЧНІ ОПЕРАЦІЇ

const numA = 10;
const numB = 2;

const resault = numA + numB; // Відповідь 12
const resault1 = numA - numB; // Відповідь 8
const resault2 = numA * numB; // Відповідь 20
const resault3 = numA / numB; // Відповідь 5
const resault4 = numA % numB; // Відповідь 0 (% залишок від ділення. Ділимо 10 / 3 = 3 і залишок 1)
const resault5 = numA ** numB; // виводить 100 (** взведення у ступінь num1 - це число, num2 - це ступінь)
//_______________________________________________________________________________________________________________________________________________________________
/*Задача 1 
Виведи на екран загальну кількість яблук та винограду.
Різницю яблук та винограду
*/
const apples = 135;
const grapes = 47;

const totalFruits = apples + grapes;
console.log(totalFruits); // виводить 182

const diff = apples - grapes;
console.log(diff); // виводить 88
//______________________________________________________________________________________________________________________________________________________________

// Заміни вираз перепризначення комбінованим оператором

let students = 100;
students = students + 50; // переписує значення на 150
console.log(students); //150

students += 50; // комбінований оператор += коротше за вираз (students = students + 50)
console.log(students); // 200
//________________________________________________________________________________________________________________________________________________________________

/* Приорітетність операторів 
Посилання на таблицю приорітетності https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Operator_precedence
*/
const result6 = 108 + 223 * 5; // Приорітетність за таблицею Відповідь
const resault7 = 108 + (223 - 2) * 5; //Відповідь 1213
