//Рядки

const firstName = 'Serhii';
const lastName = 'Tashkinov';
//
//
// конкатенація рядків_________________________________________________________________________________________________________________________________________
const fullName = firstName + ' ' + lastName + '. ';
console.log(fullName);
//__________________________________________________________________________________________________________________________________________________________
//
//
//
// Шаблонний рядок_____________________________________________________________________________________________________________________________________________
const quantity = 15;
const orderMsg = `You ordered ${quantity} bots`;
console.log(orderMsg);
//___________________________________________________________________________________________________________________________________________________________
//
//
//
/* Завдання: Запросіть у користувача ім'я та прізвище і виведіть у консоль повідомлення*/
const firstName1 = prompt("Введіть ваше ім'я");
const lastName1 = prompt('Введіть ваше прізвище');
const message = `Hello ${firstName1} ${lastName1} you are logged in!`;
console.log(message);
//________________________________________________________________________________________________________________________________________________________________
//
//
//ВЛАСТИВІСТЬ length _____________________________________________________________________________________________________________________________________________

//Дізнайтесь довжину рядка message
const message1 = 'This string is 28 chars long';
const lengthOfMessage = message1.length;
console.log(message1);
console.log(lengthOfMessage);
//_________________________________________________________________________________________________________________________________________________________________
//
//
/*Завдання: Склади фразу за допомогою шаблонних рядків
${companyName} has {repairBots + defenceBots} bots in stock,
де companyName, repairBots та defenceBots - змінні вставлені в рядок
*/

const companyName = 'Cyberdyne Systems';
const repairBots = 150;
const defenceBots = 50;

const msg = `${companyName} has ${repairBots + defenceBots} bots in stok`;
console.log(msg);
//__________________________________________________________________________________________________________________________________________________________________
