/*
 * Перетворення типів: рядки
 *
 * - Явне перетворення типів
 * - Неявне перетворення типів
 */
console.log(String(5)); // Явне перетворення на рядок
console.log(String(true)); // Явне перетворення на рядок
console.log(String(false)); // Явне перетворення на рядок
console.log(String(null)); // Явне перетворення на рядок
console.log(String(undefined)); // Явне перетворення на рядок

// НЕЯВНЕ ПЕРЕТВОРЕННЯ
console.log('5' + 5); // Неявне перетворення. 5 призводить до рядка та за допомогою + відбувається конкатенація. Відповідь 55
console.log(3 + '5'); // Відбувається те самеб що на рядку 13.  Відповідь 35
console.log('5' + true); // true призводить до рядка. Відповідь 5true
console.log('5' + false); // false призводить до рядка. Відповідь 5false
console.log('5' + null); // 5false
console.log('5' + undefined); // 5undefined

/*Перетворення типів: числа
 *
 * - Явне перетворення типів
 * - Неявне перетворення типів
 */
console.log(Number('5')); // Явне перетворення на число
console.log(Number(true)); // Явне перетворення на число. true = 1
console.log(Number(false)); // Явне перетворення на число. false = 0
console.log(Number(null)); // Явне перетворення на число. null = 0
console.log(Number(undefined)); // Явне перетворення на число. undefined = NaN
console.log(Number('Jacob')); // Явне перетворення на число. рядок = NaN
console.log(Number('25px')); // Явне перетворення на число. рядок = NaN

// УНАРНИЙ ТА БІНАРНИЙ ОПЕРАТОРИ

const resault = 10 + 20; // Бінарний означає, що він проводить операцію над 2 значеннями.
console.log(+'20'); //  Унарний. Такий самий варіант як  console.log(Number('20')) але коротший

// Неявне перетворення

console.log('5' * 2); // Неявне перетворення на число (Перетворює рядок "5" на число та множить на 2) Результат: 10
console.log('10' - 2); // Неявне перетворення на число (Перетворює рядок "10" на число та віднімає 5) Результат: 8
console.log(5 + true); // Неявне перетворення на число (Перетворює true на 1 та 5 додає до 1 ) Результат: 6
console.log(5 - true); // Неявне перетворення на число (Перетворює true на 1 та 5  віднімає від 1 ) Результат: 4
