/*ОПЕРАТОРИ
 *
 * - Оператори порівняння
 * - Оператори рівності
 */
//Оператори порівняння===================================================================================================
console.log(5 > 4); //true
console.log(10 >= '7'); // Не число призводить до числа і порівнює Відповідь: true
console.log('2' > '12'); // Рядки прорівнюються по першому символу та його номеру Юнікоду Відповідь: true
console.log('papaya' <= 'papaya'); // true рядки дорівнюють один одному

//Оператори рівності=====================================================================================================

console.log('4' == 4); //не сурове порівняння перетворює рядок до числа і порівнює Відповідь true
console.log('6' === 6); // сурове порівняння порівнює за типами даних Відповідь false
console.log('false' === false); // Відповідь false
console.log(1 == true); //Відповідь true
console.log(1 === true); //Відповідь false
console.log('0' == false); // Відповідь true
console.log('0' === false); //false
